
# State **`s3://infrahouse-aws-control-289256138624/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |   🔴 Destroy |
|:---------:|--------:|----------:|------------:|
|     ✅     |      16 |         0 |           8 |
## Affected resources by action

|  Action  | Resources                                                                                                |
|:--------:|:---------------------------------------------------------------------------------------------------------|
|    🟢     | `module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_ro`                      |
|    🟢     | `module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_rw`                      |
|    🟢     | `module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-ro`    |
|    🟢     | `module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]` |
|    🟢     | `module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_ro`                      |
|    🟢     | `module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_rw`                      |
|    🟢     | `module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-ro`    |
|    🟢     | `module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]` |
|    🟢     | `module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_ro`                      |
|    🟢     | `module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_rw`                      |
|    🟢     | `module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-ro`    |
|    🟢     | `module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]` |
|    🟢     | `module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_ro`                      |
|    🟢     | `module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_rw`                      |
|    🟢     | `module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-ro`    |
|    🟢     | `module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]` |
|    🟢     | `data.aws_iam_policy_document.ih-tf-github-control-assume:`                                              |
|    🔴     | `module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions`                         |
|    🔴     | `module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager`       |
|    🔴     | `module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions`                         |
|    🔴     | `module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager`       |
|    🔴     | `module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions`                         |
|    🔴     | `module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager`       |
|    🔴     | `module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions`                         |
|    🔴     | `module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager`       |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/156b8d8c-bd55-4ef4-bb15-fde12ca61c1a/terraform-bin plan -no-color --out=tf.plan
data.aws_iam_policy_document.ih-tf-github-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]
data.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1154989936]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager20230709154743100900000001]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager20230703025728648400000001]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-20230702155037054300000002]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager20230702155036825500000001]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager-20230709164424748700000001]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3010513807]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2670099516]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2899629952]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230702010954358800000002]
data.aws_iam_policy.administrator-access: Reading...
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=4163919237]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager-20230703025729520400000002]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3184570819]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=816952319]
aws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Reading...
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=1434185683]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3042598441]
aws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]
aws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2022835186]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=413646908]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2704423537]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2865213026]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3583068592]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=842968570]
aws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]
aws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]
aws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2241756374]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230702015240186500000001]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-493370826424]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions will be destroyed
  # (because aws_iam_policy.permissions is not in configuration)
  - resource "aws_iam_policy" "permissions" {
      - arn         = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001" -> null
      - id          = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001" -> null
      - name        = "ih-tf-aws-control-289256138624-state-manager20230702010953834400000001" -> null
      - name_prefix = "ih-tf-aws-control-289256138624-state-manager" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::infrahouse-aws-control-289256138624/terraform.tfstate",
                          - "arn:aws:s3:::infrahouse-aws-control-289256138624/plans/*",
                          - "arn:aws:s3:::infrahouse-aws-control-289256138624/*.zip",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAUGWICM6AMVMEQZFFT" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "created_by" = "infrahouse/aws-control-289256138624"
        } -> null
    }

  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_ro will be created
  + resource "aws_iam_policy" "permissions_ro" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-aws-control-289256138624-state-manager-ro"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/plans/*",
                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/*.zip",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_rw will be created
  + resource "aws_iam_policy" "permissions_rw" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-aws-control-289256138624-state-manager-rw"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/plans/*",
                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/*.zip",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager will be destroyed
  # (because aws_iam_role_policy_attachment.state-manager is not in configuration)
  - resource "aws_iam_role_policy_attachment" "state-manager" {
      - id         = "ih-tf-aws-control-289256138624-state-manager-20230702010954358800000002" -> null
      - policy_arn = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001" -> null
      - role       = "ih-tf-aws-control-289256138624-state-manager" -> null
    }

  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-289256138624-state-manager"
    }

  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-289256138624-state-manager"
    }

  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions will be destroyed
  # (because aws_iam_policy.permissions is not in configuration)
  - resource "aws_iam_policy" "permissions" {
      - arn         = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager20230702155036825500000001" -> null
      - id          = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager20230702155036825500000001" -> null
      - name        = "ih-tf-aws-control-303467602807-state-manager20230702155036825500000001" -> null
      - name_prefix = "ih-tf-aws-control-303467602807-state-manager" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-aws-control-303467602807"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::infrahouse-aws-control-303467602807/terraform.tfstate",
                          - "arn:aws:s3:::infrahouse-aws-control-303467602807/plans/*",
                          - "arn:aws:s3:::infrahouse-aws-control-303467602807/*.zip",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAUGWICM6AHSYZVNMIO" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "created_by" = "infrahouse/aws-control-289256138624"
        } -> null
    }

  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_ro will be created
  + resource "aws_iam_policy" "permissions_ro" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-aws-control-303467602807-state-manager-ro"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-aws-control-303467602807"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/plans/*",
                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/*.zip",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_rw will be created
  + resource "aws_iam_policy" "permissions_rw" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-aws-control-303467602807-state-manager-rw"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/plans/*",
                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/*.zip",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager will be destroyed
  # (because aws_iam_role_policy_attachment.state-manager is not in configuration)
  - resource "aws_iam_role_policy_attachment" "state-manager" {
      - id         = "ih-tf-aws-control-303467602807-state-manager-20230702155037054300000002" -> null
      - policy_arn = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager20230702155036825500000001" -> null
      - role       = "ih-tf-aws-control-303467602807-state-manager" -> null
    }

  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-303467602807-state-manager"
    }

  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-303467602807-state-manager"
    }

  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions will be destroyed
  # (because aws_iam_policy.permissions is not in configuration)
  - resource "aws_iam_policy" "permissions" {
      - arn         = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager20230709154743100900000001" -> null
      - id          = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager20230709154743100900000001" -> null
      - name        = "ih-tf-aws-control-493370826424-state-manager20230709154743100900000001" -> null
      - name_prefix = "ih-tf-aws-control-493370826424-state-manager" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-aws-control-493370826424"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::infrahouse-aws-control-493370826424/terraform.tfstate",
                          - "arn:aws:s3:::infrahouse-aws-control-493370826424/plans/*",
                          - "arn:aws:s3:::infrahouse-aws-control-493370826424/*.zip",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAUGWICM6ALGDIRGD77" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "created_by" = "infrahouse/aws-control-289256138624"
        } -> null
    }

  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_ro will be created
  + resource "aws_iam_policy" "permissions_ro" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-aws-control-493370826424-state-manager-ro"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-aws-control-493370826424"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/plans/*",
                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/*.zip",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_rw will be created
  + resource "aws_iam_policy" "permissions_rw" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-aws-control-493370826424-state-manager-rw"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/plans/*",
                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/*.zip",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager will be destroyed
  # (because aws_iam_role_policy_attachment.state-manager is not in configuration)
  - resource "aws_iam_role_policy_attachment" "state-manager" {
      - id         = "ih-tf-aws-control-493370826424-state-manager-20230709164424748700000001" -> null
      - policy_arn = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager20230709154743100900000001" -> null
      - role       = "ih-tf-aws-control-493370826424-state-manager" -> null
    }

  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-493370826424-state-manager"
    }

  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-493370826424-state-manager"
    }

  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions will be destroyed
  # (because aws_iam_policy.permissions is not in configuration)
  - resource "aws_iam_policy" "permissions" {
      - arn         = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager20230703025728648400000001" -> null
      - id          = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager20230703025728648400000001" -> null
      - name        = "ih-tf-aws-control-state-manager20230703025728648400000001" -> null
      - name_prefix = "ih-tf-aws-control-state-manager" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-aws-control-990466748045"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::infrahouse-aws-control-990466748045/terraform.tfstate",
                          - "arn:aws:s3:::infrahouse-aws-control-990466748045/plans/*",
                          - "arn:aws:s3:::infrahouse-aws-control-990466748045/*.zip",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAUGWICM6AHSDU646SS" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "created_by" = "infrahouse/aws-control-289256138624"
        } -> null
    }

  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_ro will be created
  + resource "aws_iam_policy" "permissions_ro" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-aws-control-state-manager-ro"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-aws-control-990466748045"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/plans/*",
                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/*.zip",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_rw will be created
  + resource "aws_iam_policy" "permissions_rw" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-aws-control-state-manager-rw"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/plans/*",
                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/*.zip",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager will be destroyed
  # (because aws_iam_role_policy_attachment.state-manager is not in configuration)
  - resource "aws_iam_role_policy_attachment" "state-manager" {
      - id         = "ih-tf-aws-control-state-manager-20230703025729520400000002" -> null
      - policy_arn = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager20230703025728648400000001" -> null
      - role       = "ih-tf-aws-control-state-manager" -> null
    }

  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-state-manager"
    }

  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-state-manager"
    }

Plan: 16 to add, 0 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.ih-tf-github-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1154989936]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager20230709154743100900000001]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager20230703025728648400000001]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-20230702155037054300000002]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager20230702155036825500000001]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager-20230709164424748700000001]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3010513807]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2670099516]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2899629952]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230702010954358800000002]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=4163919237]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager-20230703025729520400000002]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3184570819]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=816952319]%0Aaws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=1434185683]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3042598441]%0Aaws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]%0Aaws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]%0Aaws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2022835186]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=413646908]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2704423537]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2865213026]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3583068592]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=842968570]%0Aaws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]%0Aaws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2241756374]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230702015240186500000001]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-493370826424]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions will be destroyed%0A  # (because aws_iam_policy.permissions is not in configuration)%0A  - resource "aws_iam_policy" "permissions" {%0A      - arn         = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001" -> null%0A      - id          = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001" -> null%0A      - name        = "ih-tf-aws-control-289256138624-state-manager20230702010953834400000001" -> null%0A      - name_prefix = "ih-tf-aws-control-289256138624-state-manager" -> null%0A      - path        = "/" -> null%0A      - policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = "s3:ListBucket"%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624"%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "s3:PutObject",%0A                          - "s3:GetObject",%0A                          - "s3:DeleteObject",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = [%0A                          - "arn:aws:s3:::infrahouse-aws-control-289256138624/terraform.tfstate",%0A                          - "arn:aws:s3:::infrahouse-aws-control-289256138624/plans/*",%0A                          - "arn:aws:s3:::infrahouse-aws-control-289256138624/*.zip",%0A                        ]%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "dynamodb:PutItem",%0A                          - "dynamodb:GetItem",%0A                          - "dynamodb:DescribeTable",%0A                          - "dynamodb:DeleteItem",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                      - Sid      = ""%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - policy_id   = "ANPAUGWICM6AMVMEQZFFT" -> null%0A      - tags        = {} -> null%0A      - tags_all    = {%0A          - "created_by" = "infrahouse/aws-control-289256138624"%0A        } -> null%0A    }%0A%0A  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_ro will be created%0A  + resource "aws_iam_policy" "permissions_ro" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-aws-control-289256138624-state-manager-ro"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "s3:ListBucket"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624"%0A                    },%0A                  + {%0A                      + Action   = "s3:GetObject"%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/plans/*",%0A                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/*.zip",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_rw will be created%0A  + resource "aws_iam_policy" "permissions_rw" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-aws-control-289256138624-state-manager-rw"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutObject",%0A                          + "s3:DeleteObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/plans/*",%0A                          + "arn:aws:s3:::infrahouse-aws-control-289256138624/*.zip",%0A                        ]%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "dynamodb:PutItem",%0A                          + "dynamodb:GetItem",%0A                          + "dynamodb:DescribeTable",%0A                          + "dynamodb:DeleteItem",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager will be destroyed%0A  # (because aws_iam_role_policy_attachment.state-manager is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "state-manager" {%0A      - id         = "ih-tf-aws-control-289256138624-state-manager-20230702010954358800000002" -> null%0A      - policy_arn = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001" -> null%0A      - role       = "ih-tf-aws-control-289256138624-state-manager" -> null%0A    }%0A%0A  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-289256138624-state-manager"%0A    }%0A%0A  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-289256138624-state-manager"%0A    }%0A%0A  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions will be destroyed%0A  # (because aws_iam_policy.permissions is not in configuration)%0A  - resource "aws_iam_policy" "permissions" {%0A      - arn         = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager20230702155036825500000001" -> null%0A      - id          = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager20230702155036825500000001" -> null%0A      - name        = "ih-tf-aws-control-303467602807-state-manager20230702155036825500000001" -> null%0A      - name_prefix = "ih-tf-aws-control-303467602807-state-manager" -> null%0A      - path        = "/" -> null%0A      - policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = "s3:ListBucket"%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:s3:::infrahouse-aws-control-303467602807"%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "s3:PutObject",%0A                          - "s3:GetObject",%0A                          - "s3:DeleteObject",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = [%0A                          - "arn:aws:s3:::infrahouse-aws-control-303467602807/terraform.tfstate",%0A                          - "arn:aws:s3:::infrahouse-aws-control-303467602807/plans/*",%0A                          - "arn:aws:s3:::infrahouse-aws-control-303467602807/*.zip",%0A                        ]%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "dynamodb:PutItem",%0A                          - "dynamodb:GetItem",%0A                          - "dynamodb:DescribeTable",%0A                          - "dynamodb:DeleteItem",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                      - Sid      = ""%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - policy_id   = "ANPAUGWICM6AHSYZVNMIO" -> null%0A      - tags        = {} -> null%0A      - tags_all    = {%0A          - "created_by" = "infrahouse/aws-control-289256138624"%0A        } -> null%0A    }%0A%0A  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_ro will be created%0A  + resource "aws_iam_policy" "permissions_ro" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-aws-control-303467602807-state-manager-ro"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "s3:ListBucket"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-aws-control-303467602807"%0A                    },%0A                  + {%0A                      + Action   = "s3:GetObject"%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/plans/*",%0A                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/*.zip",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_rw will be created%0A  + resource "aws_iam_policy" "permissions_rw" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-aws-control-303467602807-state-manager-rw"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutObject",%0A                          + "s3:DeleteObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/plans/*",%0A                          + "arn:aws:s3:::infrahouse-aws-control-303467602807/*.zip",%0A                        ]%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "dynamodb:PutItem",%0A                          + "dynamodb:GetItem",%0A                          + "dynamodb:DescribeTable",%0A                          + "dynamodb:DeleteItem",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager will be destroyed%0A  # (because aws_iam_role_policy_attachment.state-manager is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "state-manager" {%0A      - id         = "ih-tf-aws-control-303467602807-state-manager-20230702155037054300000002" -> null%0A      - policy_arn = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager20230702155036825500000001" -> null%0A      - role       = "ih-tf-aws-control-303467602807-state-manager" -> null%0A    }%0A%0A  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-303467602807-state-manager"%0A    }%0A%0A  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-303467602807-state-manager"%0A    }%0A%0A  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions will be destroyed%0A  # (because aws_iam_policy.permissions is not in configuration)%0A  - resource "aws_iam_policy" "permissions" {%0A      - arn         = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager20230709154743100900000001" -> null%0A      - id          = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager20230709154743100900000001" -> null%0A      - name        = "ih-tf-aws-control-493370826424-state-manager20230709154743100900000001" -> null%0A      - name_prefix = "ih-tf-aws-control-493370826424-state-manager" -> null%0A      - path        = "/" -> null%0A      - policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = "s3:ListBucket"%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:s3:::infrahouse-aws-control-493370826424"%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "s3:PutObject",%0A                          - "s3:GetObject",%0A                          - "s3:DeleteObject",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = [%0A                          - "arn:aws:s3:::infrahouse-aws-control-493370826424/terraform.tfstate",%0A                          - "arn:aws:s3:::infrahouse-aws-control-493370826424/plans/*",%0A                          - "arn:aws:s3:::infrahouse-aws-control-493370826424/*.zip",%0A                        ]%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "dynamodb:PutItem",%0A                          - "dynamodb:GetItem",%0A                          - "dynamodb:DescribeTable",%0A                          - "dynamodb:DeleteItem",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                      - Sid      = ""%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - policy_id   = "ANPAUGWICM6ALGDIRGD77" -> null%0A      - tags        = {} -> null%0A      - tags_all    = {%0A          - "created_by" = "infrahouse/aws-control-289256138624"%0A        } -> null%0A    }%0A%0A  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_ro will be created%0A  + resource "aws_iam_policy" "permissions_ro" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-aws-control-493370826424-state-manager-ro"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "s3:ListBucket"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-aws-control-493370826424"%0A                    },%0A                  + {%0A                      + Action   = "s3:GetObject"%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/plans/*",%0A                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/*.zip",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_rw will be created%0A  + resource "aws_iam_policy" "permissions_rw" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-aws-control-493370826424-state-manager-rw"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutObject",%0A                          + "s3:DeleteObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/plans/*",%0A                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/*.zip",%0A                        ]%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "dynamodb:PutItem",%0A                          + "dynamodb:GetItem",%0A                          + "dynamodb:DescribeTable",%0A                          + "dynamodb:DeleteItem",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager will be destroyed%0A  # (because aws_iam_role_policy_attachment.state-manager is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "state-manager" {%0A      - id         = "ih-tf-aws-control-493370826424-state-manager-20230709164424748700000001" -> null%0A      - policy_arn = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager20230709154743100900000001" -> null%0A      - role       = "ih-tf-aws-control-493370826424-state-manager" -> null%0A    }%0A%0A  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-493370826424-state-manager"%0A    }%0A%0A  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-493370826424-state-manager"%0A    }%0A%0A  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions will be destroyed%0A  # (because aws_iam_policy.permissions is not in configuration)%0A  - resource "aws_iam_policy" "permissions" {%0A      - arn         = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager20230703025728648400000001" -> null%0A      - id          = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager20230703025728648400000001" -> null%0A      - name        = "ih-tf-aws-control-state-manager20230703025728648400000001" -> null%0A      - name_prefix = "ih-tf-aws-control-state-manager" -> null%0A      - path        = "/" -> null%0A      - policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = "s3:ListBucket"%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:s3:::infrahouse-aws-control-990466748045"%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "s3:PutObject",%0A                          - "s3:GetObject",%0A                          - "s3:DeleteObject",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = [%0A                          - "arn:aws:s3:::infrahouse-aws-control-990466748045/terraform.tfstate",%0A                          - "arn:aws:s3:::infrahouse-aws-control-990466748045/plans/*",%0A                          - "arn:aws:s3:::infrahouse-aws-control-990466748045/*.zip",%0A                        ]%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "dynamodb:PutItem",%0A                          - "dynamodb:GetItem",%0A                          - "dynamodb:DescribeTable",%0A                          - "dynamodb:DeleteItem",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                      - Sid      = ""%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - policy_id   = "ANPAUGWICM6AHSDU646SS" -> null%0A      - tags        = {} -> null%0A      - tags_all    = {%0A          - "created_by" = "infrahouse/aws-control-289256138624"%0A        } -> null%0A    }%0A%0A  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_ro will be created%0A  + resource "aws_iam_policy" "permissions_ro" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-aws-control-state-manager-ro"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "s3:ListBucket"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-aws-control-990466748045"%0A                    },%0A                  + {%0A                      + Action   = "s3:GetObject"%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/plans/*",%0A                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/*.zip",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_rw will be created%0A  + resource "aws_iam_policy" "permissions_rw" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-aws-control-state-manager-rw"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutObject",%0A                          + "s3:DeleteObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/plans/*",%0A                          + "arn:aws:s3:::infrahouse-aws-control-990466748045/*.zip",%0A                        ]%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "dynamodb:PutItem",%0A                          + "dynamodb:GetItem",%0A                          + "dynamodb:DescribeTable",%0A                          + "dynamodb:DeleteItem",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager will be destroyed%0A  # (because aws_iam_role_policy_attachment.state-manager is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "state-manager" {%0A      - id         = "ih-tf-aws-control-state-manager-20230703025729520400000002" -> null%0A      - policy_arn = "arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager20230703025728648400000001" -> null%0A      - role       = "ih-tf-aws-control-state-manager" -> null%0A    }%0A%0A  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-state-manager"%0A    }%0A%0A  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-state-manager"%0A    }%0A%0APlan: 16 to add, 0 to change, 8 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC8xNTZiOGQ4Yy1iZDU1LTRlZjQtYmIxNS1mZGUxMmNhNjFjMWEvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWdpdGh1Yi1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWdpdGh1Yi1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTUyMTEyOTczN11cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTQ5ODk5MzZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDIwMTA5NTM4MzQ0MDAwMDAwMDFdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIyMDIzMDcwOTE1NDc0MzEwMDkwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDMwMjU3Mjg2NDg0MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItMjAyMzA3MDIxNTUwMzcwNTQzMDAwMDAwMDJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDIxNTUwMzY4MjU1MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwNzA5MTY0NDI0NzQ4NzAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzAxMDUxMzgwN11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjY3MDA5OTUxNl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItMjAyMzA3MDIwMTA5NTQzNTg4MDAwMDAwMDJdXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE2MzkxOTIzN11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlci0yMDIzMDcwMzAyNTcyOTUyMDQwMDAwMDAwMl1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMTg0NTcwODE5XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD04MTY5NTIzMTldXG5hd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE0MzQxODU2ODNdXG5tb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMDQyNTk4NDQxXVxuYXdzX2lhbV9yb2xlLmloLXRmLWdpdGh1Yi1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbF1cbmF3c19pYW1fcm9sZS5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2xdXG5hd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRlcnJhZm9ybS1zdGF0ZS1sb2Nrc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlcl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMDIyODM1MTg2XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTM2NDY5MDhdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI3MDQ0MjM1MzddXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4NjUyMTMwMjZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzU4MzA2ODU5Ml1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD04NDI5Njg1NzBdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sLTIwMjMwNjI3MTcyNzMzOTMxMjAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWF3cy1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yMDIzMDYzMDAwMzUzMDUzMDkwMDAwMDAwMV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtMjAyMzA2MjcxNzI3MzQzNzA0MDAwMDAwMDJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjI0MTc1NjM3NF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4tMjAyMzA3MDIwMTUyNDAxODY1MDAwMDAwMDFdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIC0gZGVzdHJveVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9ucyB3aWxsIGJlIGRlc3Ryb3llZFxuICAjIChiZWNhdXNlIGF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zXCIge1xuICAgICAgLSBhcm4gICAgICAgICA9IFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIyMDIzMDcwMjAxMDk1MzgzNDQwMDAwMDAwMVwiIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDIwMTA5NTM4MzQ0MDAwMDAwMDFcIiAtPiBudWxsXG4gICAgICAtIG5hbWUgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlcjIwMjMwNzAyMDEwOTUzODM0NDAwMDAwMDAxXCIgLT4gbnVsbFxuICAgICAgLSBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJcIiAtPiBudWxsXG4gICAgICAtIHBhdGggICAgICAgID0gXCIvXCIgLT4gbnVsbFxuICAgICAgLSBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgIC0gU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgLSB7XG4gICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFwiczM6TGlzdEJ1Y2tldFwiXG4gICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICAgIC0ge1xuICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpQdXRPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOkdldE9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6RGVsZXRlT2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQvdGVycmFmb3JtLnRmc3RhdGVcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC9wbGFucy8qXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQvKi56aXBcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgLSB7XG4gICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOlB1dEl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOkdldEl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOkRlc2NyaWJlVGFibGVcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOkRlbGV0ZUl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFwiYXJuOmF3czpkeW5hbW9kYjp1cy13ZXN0LTE6Mjg5MjU2MTM4NjI0OnRhYmxlL2luZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgLSBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApIC0+IG51bGxcbiAgICAgIC0gcG9saWN5X2lkICAgPSBcIkFOUEFVR1dJQ002QU1WTUVRWkZGVFwiIC0+IG51bGxcbiAgICAgIC0gdGFncyAgICAgICAgPSB7fSAtPiBudWxsXG4gICAgICAtIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfSAtPiBudWxsXG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zX3JvXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItcm9cIlxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpMaXN0QnVja2V0XCJcbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOkdldE9iamVjdFwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQvdGVycmFmb3JtLnRmc3RhdGVcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC9wbGFucy8qXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQvKi56aXBcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKVxuICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3J3IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zX3J3XCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItcndcIlxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0T2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpEZWxldGVPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC90ZXJyYWZvcm0udGZzdGF0ZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3BsYW5zLypcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC8qLnppcFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOlB1dEl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkdldEl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkRlc2NyaWJlVGFibGVcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkRlbGV0ZUl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpkeW5hbW9kYjp1cy13ZXN0LTE6Mjg5MjU2MTM4NjI0OnRhYmxlL2luZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKVxuICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXIgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXJcIiB7XG4gICAgICAtIGlkICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwNzAyMDEwOTU0MzU4ODAwMDAwMDAyXCIgLT4gbnVsbFxuICAgICAgLSBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlcjIwMjMwNzAyMDEwOTUzODM0NDAwMDAwMDAxXCIgLT4gbnVsbFxuICAgICAgLSByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlclwiIC0+IG51bGxcbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcm8gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXItcm9cIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXItcndcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnMgd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBhd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9ucyBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc1wiIHtcbiAgICAgIC0gYXJuICAgICAgICAgPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDIxNTUwMzY4MjU1MDAwMDAwMDFcIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlcjIwMjMwNzAyMTU1MDM2ODI1NTAwMDAwMDAxXCIgLT4gbnVsbFxuICAgICAgLSBuYW1lICAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIyMDIzMDcwMjE1NTAzNjgyNTUwMDAwMDAwMVwiIC0+IG51bGxcbiAgICAgIC0gbmFtZV9wcmVmaXggPSBcImloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyXCIgLT4gbnVsbFxuICAgICAgLSBwYXRoICAgICAgICA9IFwiL1wiIC0+IG51bGxcbiAgICAgIC0gcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAtIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgIC0ge1xuICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6UHV0T2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpHZXRPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOkRlbGV0ZU9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDcvcGxhbnMvKlwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LyouemlwXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICAgIC0ge1xuICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJkeW5hbW9kYjpQdXRJdGVtXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJkeW5hbW9kYjpHZXRJdGVtXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJkeW5hbW9kYjpEZXNjcmliZVRhYmxlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJkeW5hbW9kYjpEZWxldGVJdGVtXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcImFybjphd3M6ZHluYW1vZGI6dXMtd2VzdC0xOjI4OTI1NjEzODYyNDp0YWJsZS9pbmZyYWhvdXNlLXRlcnJhZm9ybS1zdGF0ZS1sb2Nrc1wiXG4gICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgIC0gVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKSAtPiBudWxsXG4gICAgICAtIHBvbGljeV9pZCAgID0gXCJBTlBBVUdXSUNNNkFIU1laVk5NSU9cIiAtPiBudWxsXG4gICAgICAtIHRhZ3MgICAgICAgID0ge30gLT4gbnVsbFxuICAgICAgLSB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgIH0gLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc19yb1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggPSBcImloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJvXCJcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwiczM6TGlzdEJ1Y2tldFwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpHZXRPYmplY3RcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDcvcGxhbnMvKlwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LyouemlwXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc19yd1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggPSBcImloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJ3XCJcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOlB1dE9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6RGVsZXRlT2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDcvdGVycmFmb3JtLnRmc3RhdGVcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy9wbGFucy8qXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDcvKi56aXBcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpQdXRJdGVtXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpHZXRJdGVtXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpEZXNjcmliZVRhYmxlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpEZWxldGVJdGVtXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcImFybjphd3M6ZHluYW1vZGI6dXMtd2VzdC0xOjI4OTI1NjEzODYyNDp0YWJsZS9pbmZyYWhvdXNlLXRlcnJhZm9ybS1zdGF0ZS1sb2Nrc1wiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlciB3aWxsIGJlIGRlc3Ryb3llZFxuICAjIChiZWNhdXNlIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyXCIge1xuICAgICAgLSBpZCAgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci0yMDIzMDcwMjE1NTAzNzA1NDMwMDAwMDAwMlwiIC0+IG51bGxcbiAgICAgIC0gcG9saWN5X2FybiA9IFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIyMDIzMDcwMjE1NTAzNjgyNTUwMDAwMDAwMVwiIC0+IG51bGxcbiAgICAgIC0gcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXJcIiAtPiBudWxsXG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyLXJvXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlclwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyLXJ3XCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlclwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnMgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNcIiB7XG4gICAgICAtIGFybiAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlcjIwMjMwNzA5MTU0NzQzMTAwOTAwMDAwMDAxXCIgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgICA9IFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIyMDIzMDcwOTE1NDc0MzEwMDkwMDAwMDAwMVwiIC0+IG51bGxcbiAgICAgIC0gbmFtZSAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDkxNTQ3NDMxMDA5MDAwMDAwMDFcIiAtPiBudWxsXG4gICAgICAtIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlclwiIC0+IG51bGxcbiAgICAgIC0gcGF0aCAgICAgICAgPSBcIi9cIiAtPiBudWxsXG4gICAgICAtIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgLSBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gXCJzMzpMaXN0QnVja2V0XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgLSB7XG4gICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOlB1dE9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6R2V0T2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpEZWxldGVPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC90ZXJyYWZvcm0udGZzdGF0ZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3BsYW5zLypcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC8qLnppcFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6UHV0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6R2V0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOmR5bmFtb2RiOnVzLXdlc3QtMToyODkyNTYxMzg2MjQ6dGFibGUvaW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAtIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgICkgLT4gbnVsbFxuICAgICAgLSBwb2xpY3lfaWQgICA9IFwiQU5QQVVHV0lDTTZBTEdESVJHRDc3XCIgLT4gbnVsbFxuICAgICAgLSB0YWdzICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgIC0gdGFnc19hbGwgICAgPSB7XG4gICAgICAgICAgLSBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICB9IC0+IG51bGxcbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm8gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNfcm9cIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci1yb1wiXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwiczM6R2V0T2JqZWN0XCJcbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC90ZXJyYWZvcm0udGZzdGF0ZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3BsYW5zLypcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC8qLnppcFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcncgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNfcndcIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci1yd1wiXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpQdXRPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOkRlbGV0ZU9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQvcGxhbnMvKlwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LyouemlwXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6UHV0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6R2V0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOmR5bmFtb2RiOnVzLXdlc3QtMToyODkyNTYxMzg2MjQ6dGFibGUvaW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXIgd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlciBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlclwiIHtcbiAgICAgIC0gaWQgICAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXItMjAyMzA3MDkxNjQ0MjQ3NDg3MDAwMDAwMDFcIiAtPiBudWxsXG4gICAgICAtIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDkxNTQ3NDMxMDA5MDAwMDAwMDFcIiAtPiBudWxsXG4gICAgICAtIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyXCIgLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlci1yb1wiIHtcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXJcIlxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlci1yd1wiIHtcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXJcIlxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9ucyB3aWxsIGJlIGRlc3Ryb3llZFxuICAjIChiZWNhdXNlIGF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zXCIge1xuICAgICAgLSBhcm4gICAgICAgICA9IFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlcjIwMjMwNzAzMDI1NzI4NjQ4NDAwMDAwMDAxXCIgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgICA9IFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlcjIwMjMwNzAzMDI1NzI4NjQ4NDAwMDAwMDAxXCIgLT4gbnVsbFxuICAgICAgLSBuYW1lICAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlcjIwMjMwNzAzMDI1NzI4NjQ4NDAwMDAwMDAxXCIgLT4gbnVsbFxuICAgICAgLSBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlclwiIC0+IG51bGxcbiAgICAgIC0gcGF0aCAgICAgICAgPSBcIi9cIiAtPiBudWxsXG4gICAgICAtIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgLSBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gXCJzMzpMaXN0QnVja2V0XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgLSB7XG4gICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOlB1dE9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6R2V0T2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpEZWxldGVPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS90ZXJyYWZvcm0udGZzdGF0ZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3BsYW5zLypcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS8qLnppcFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6UHV0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6R2V0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOmR5bmFtb2RiOnVzLXdlc3QtMToyODkyNTYxMzg2MjQ6dGFibGUvaW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAtIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgICkgLT4gbnVsbFxuICAgICAgLSBwb2xpY3lfaWQgICA9IFwiQU5QQVVHV0lDTTZBSFNEVTY0NlNTXCIgLT4gbnVsbFxuICAgICAgLSB0YWdzICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgIC0gdGFnc19hbGwgICAgPSB7XG4gICAgICAgICAgLSBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICB9IC0+IG51bGxcbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm8gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNfcm9cIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyLXJvXCJcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwiczM6TGlzdEJ1Y2tldFwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpHZXRPYmplY3RcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUvcGxhbnMvKlwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LyouemlwXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc19yd1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggPSBcImloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItcndcIlxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0T2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpEZWxldGVPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS90ZXJyYWZvcm0udGZzdGF0ZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3BsYW5zLypcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS8qLnppcFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOlB1dEl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkdldEl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkRlc2NyaWJlVGFibGVcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkRlbGV0ZUl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpkeW5hbW9kYjp1cy13ZXN0LTE6Mjg5MjU2MTM4NjI0OnRhYmxlL2luZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKVxuICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXIgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXJcIiB7XG4gICAgICAtIGlkICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItMjAyMzA3MDMwMjU3Mjk1MjA0MDAwMDAwMDJcIiAtPiBudWxsXG4gICAgICAtIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXIyMDIzMDcwMzAyNTcyODY0ODQwMDAwMDAwMVwiIC0+IG51bGxcbiAgICAgIC0gcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlclwiIC0+IG51bGxcbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcm8gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXItcm9cIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXJcIlxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlci1yd1wiIHtcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlclwiXG4gICAgfVxuXG5QbGFuOiAxNiB0byBhZGQsIDAgdG8gY2hhbmdlLCA4IHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcblJlbGVhc2luZyBzdGF0ZSBsb2NrLiBUaGlzIG1heSB0YWtlIGEgZmV3IG1vbWVudHMuLi5cbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTIxMTI5NzM3XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTU0OTg5OTM2XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIyMDIzMDcwMjAxMDk1MzgzNDQwMDAwMDAwMV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDkxNTQ3NDMxMDA5MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDMwMjU3Mjg2NDg0MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItMjAyMzA3MDIxNTUwMzcwNTQzMDAwMDAwMDJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlcjIwMjMwNzAyMTU1MDM2ODI1NTAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXItMjAyMzA3MDkxNjQ0MjQ3NDg3MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzAxMDUxMzgwN10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI2NzAwOTk1MTZdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODk5NjI5OTUyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItMjAyMzA3MDIwMTA5NTQzNTg4MDAwMDAwMDJdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE2MzkxOTIzN10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItMjAyMzA3MDMwMjU3Mjk1MjA0MDAwMDAwMDJdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzE4NDU3MDgxOV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD04MTY5NTIzMTldJTBBYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNDM0MTg1NjgzXSUwQW1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzA0MjU5ODQ0MV0lMEFhd3NfaWFtX3JvbGUuaWgtdGYtZ2l0aHViLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sXSUwQWF3c19pYW1fcm9sZS5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2xdJTBBYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMDIyODM1MTg2XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWdpdGh1Yl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDEzNjQ2OTA4XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjcwNDQyMzUzN10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW5dJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODY1MjEzMDI2XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTgzMDY4NTkyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD04NDI5Njg1NzBdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbC0yMDIzMDYyNzE3MjczMzkzMTIwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtYXdzLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTIwMjMwNjMwMDAzNTMwNTMwOTAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtMjAyMzA2MjcxNzI3MzQzNzA0MDAwMDAwMDJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyNDE3NTYzNzRdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4tMjAyMzA3MDIwMTUyNDAxODY1MDAwMDAwMDFdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN10lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSAgLSBkZXN0cm95JTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9ucyB3aWxsIGJlIGRlc3Ryb3llZCUwQSAgIyAoYmVjYXVzZSBhd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9ucyBpcyBub3QgaW4gY29uZmlndXJhdGlvbiklMEEgIC0gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNcIiB7JTBBICAgICAgLSBhcm4gICAgICAgICA9IFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIyMDIzMDcwMjAxMDk1MzgzNDQwMDAwMDAwMVwiIC0+IG51bGwlMEEgICAgICAtIGlkICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlcjIwMjMwNzAyMDEwOTUzODM0NDAwMDAwMDAxXCIgLT4gbnVsbCUwQSAgICAgIC0gbmFtZSAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDIwMTA5NTM4MzQ0MDAwMDAwMDFcIiAtPiBudWxsJTBBICAgICAgLSBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJcIiAtPiBudWxsJTBBICAgICAgLSBwYXRoICAgICAgICA9IFwiL1wiIC0+IG51bGwlMEEgICAgICAtIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICAtIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFwiczM6TGlzdEJ1Y2tldFwiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6UHV0T2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6R2V0T2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6RGVsZXRlT2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3BsYW5zLypcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQvKi56aXBcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgIC0geyUwQSAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOlB1dEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJkeW5hbW9kYjpHZXRJdGVtXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOkRlbGV0ZUl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFwiYXJuOmF3czpkeW5hbW9kYjp1cy13ZXN0LTE6Mjg5MjU2MTM4NjI0OnRhYmxlL2luZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgIC0gVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApIC0+IG51bGwlMEEgICAgICAtIHBvbGljeV9pZCAgID0gXCJBTlBBVUdXSUNNNkFNVk1FUVpGRlRcIiAtPiBudWxsJTBBICAgICAgLSB0YWdzICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICAtIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9IC0+IG51bGwlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm8gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zX3JvXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLXJvXCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwiczM6TGlzdEJ1Y2tldFwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOkdldE9iamVjdFwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQvdGVycmFmb3JtLnRmc3RhdGVcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQvcGxhbnMvKlwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC8qLnppcFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3J3IHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc19yd1wiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci1yd1wiJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0T2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6RGVsZXRlT2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3BsYW5zLypcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQvKi56aXBcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOlB1dEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpHZXRJdGVtXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkRlbGV0ZUl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpkeW5hbW9kYjp1cy13ZXN0LTE6Mjg5MjU2MTM4NjI0OnRhYmxlL2luZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyIHdpbGwgYmUgZGVzdHJveWVkJTBBICAjIChiZWNhdXNlIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKSUwQSAgLSByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlclwiIHslMEEgICAgICAtIGlkICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwNzAyMDEwOTU0MzU4ODAwMDAwMDAyXCIgLT4gbnVsbCUwQSAgICAgIC0gcG9saWN5X2FybiA9IFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIyMDIzMDcwMjAxMDk1MzgzNDQwMDAwMDAwMVwiIC0+IG51bGwlMEEgICAgICAtIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXCIgLT4gbnVsbCUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXItcm9cIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyLXJ3XCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlclwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zIHdpbGwgYmUgZGVzdHJveWVkJTBBICAjIChiZWNhdXNlIGF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKSUwQSAgLSByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc1wiIHslMEEgICAgICAtIGFybiAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlcjIwMjMwNzAyMTU1MDM2ODI1NTAwMDAwMDAxXCIgLT4gbnVsbCUwQSAgICAgIC0gaWQgICAgICAgICAgPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDIxNTUwMzY4MjU1MDAwMDAwMDFcIiAtPiBudWxsJTBBICAgICAgLSBuYW1lICAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIyMDIzMDcwMjE1NTAzNjgyNTUwMDAwMDAwMVwiIC0+IG51bGwlMEEgICAgICAtIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlclwiIC0+IG51bGwlMEEgICAgICAtIHBhdGggICAgICAgID0gXCIvXCIgLT4gbnVsbCUwQSAgICAgIC0gcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICAgIHslMEEgICAgICAgICAgICAgIC0gU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgIC0geyUwQSAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gXCJzMzpMaXN0QnVja2V0XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpQdXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpHZXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpEZWxldGVPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDcvdGVycmFmb3JtLnRmc3RhdGVcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDcvcGxhbnMvKlwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy8qLnppcFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6UHV0SXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOkdldEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJkeW5hbW9kYjpEZXNjcmliZVRhYmxlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOmR5bmFtb2RiOnVzLXdlc3QtMToyODkyNTYxMzg2MjQ6dGFibGUvaW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgLSBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICkgLT4gbnVsbCUwQSAgICAgIC0gcG9saWN5X2lkICAgPSBcIkFOUEFVR1dJQ002QUhTWVpWTk1JT1wiIC0+IG51bGwlMEEgICAgICAtIHRhZ3MgICAgICAgID0ge30gLT4gbnVsbCUwQSAgICAgIC0gdGFnc19hbGwgICAgPSB7JTBBICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgIH0gLT4gbnVsbCUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNfcm9cIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcm9cIiUwQSAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICAgIHslMEEgICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpMaXN0QnVja2V0XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwiczM6R2V0T2JqZWN0XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy90ZXJyYWZvcm0udGZzdGF0ZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy9wbGFucy8qXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LyouemlwXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcncgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zX3J3XCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcImloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJ3XCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpQdXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpEZWxldGVPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDcvdGVycmFmb3JtLnRmc3RhdGVcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDcvcGxhbnMvKlwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy8qLnppcFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6UHV0SXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkdldEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpEZXNjcmliZVRhYmxlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOmR5bmFtb2RiOnVzLXdlc3QtMToyODkyNTYxMzg2MjQ6dGFibGUvaW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXIgd2lsbCBiZSBkZXN0cm95ZWQlMEEgICMgKGJlY2F1c2UgYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXIgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pJTBBICAtIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyXCIgeyUwQSAgICAgIC0gaWQgICAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItMjAyMzA3MDIxNTUwMzcwNTQzMDAwMDAwMDJcIiAtPiBudWxsJTBBICAgICAgLSBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlcjIwMjMwNzAyMTU1MDM2ODI1NTAwMDAwMDAxXCIgLT4gbnVsbCUwQSAgICAgIC0gcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXJcIiAtPiBudWxsJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlci1yb1wiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXJcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXItcndcIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnMgd2lsbCBiZSBkZXN0cm95ZWQlMEEgICMgKGJlY2F1c2UgYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnMgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pJTBBICAtIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zXCIgeyUwQSAgICAgIC0gYXJuICAgICAgICAgPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDkxNTQ3NDMxMDA5MDAwMDAwMDFcIiAtPiBudWxsJTBBICAgICAgLSBpZCAgICAgICAgICA9IFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIyMDIzMDcwOTE1NDc0MzEwMDkwMDAwMDAwMVwiIC0+IG51bGwlMEEgICAgICAtIG5hbWUgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlcjIwMjMwNzA5MTU0NzQzMTAwOTAwMDAwMDAxXCIgLT4gbnVsbCUwQSAgICAgIC0gbmFtZV9wcmVmaXggPSBcImloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyXCIgLT4gbnVsbCUwQSAgICAgIC0gcGF0aCAgICAgICAgPSBcIi9cIiAtPiBudWxsJTBBICAgICAgLSBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgLSBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgIC0geyUwQSAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOlB1dE9iamVjdFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOkdldE9iamVjdFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOkRlbGV0ZU9iamVjdFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC90ZXJyYWZvcm0udGZzdGF0ZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC9wbGFucy8qXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LyouemlwXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJkeW5hbW9kYjpQdXRJdGVtXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6R2V0SXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOkRlc2NyaWJlVGFibGVcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJkeW5hbW9kYjpEZWxldGVJdGVtXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcImFybjphd3M6ZHluYW1vZGI6dXMtd2VzdC0xOjI4OTI1NjEzODYyNDp0YWJsZS9pbmZyYWhvdXNlLXRlcnJhZm9ybS1zdGF0ZS1sb2Nrc1wiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAtIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSAtPiBudWxsJTBBICAgICAgLSBwb2xpY3lfaWQgICA9IFwiQU5QQVVHV0lDTTZBTEdESVJHRDc3XCIgLT4gbnVsbCUwQSAgICAgIC0gdGFncyAgICAgICAgPSB7fSAtPiBudWxsJTBBICAgICAgLSB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgLSBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgfSAtPiBudWxsJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc19yb1wiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci1yb1wiJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpHZXRPYmplY3RcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3BsYW5zLypcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQvKi56aXBcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNfcndcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXItcndcIiUwQSAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICAgIHslMEEgICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOlB1dE9iamVjdFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOkRlbGV0ZU9iamVjdFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC90ZXJyYWZvcm0udGZzdGF0ZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC9wbGFucy8qXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LyouemlwXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpQdXRJdGVtXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6R2V0SXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkRlc2NyaWJlVGFibGVcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpEZWxldGVJdGVtXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcImFybjphd3M6ZHluYW1vZGI6dXMtd2VzdC0xOjI4OTI1NjEzODYyNDp0YWJsZS9pbmZyYWhvdXNlLXRlcnJhZm9ybS1zdGF0ZS1sb2Nrc1wiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlciB3aWxsIGJlIGRlc3Ryb3llZCUwQSAgIyAoYmVjYXVzZSBhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlciBpcyBub3QgaW4gY29uZmlndXJhdGlvbiklMEEgIC0gcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXJcIiB7JTBBICAgICAgLSBpZCAgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci0yMDIzMDcwOTE2NDQyNDc0ODcwMDAwMDAwMVwiIC0+IG51bGwlMEEgICAgICAtIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDkxNTQ3NDMxMDA5MDAwMDAwMDFcIiAtPiBudWxsJTBBICAgICAgLSByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlclwiIC0+IG51bGwlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcm8gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyLXJvXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlclwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlci1yd1wiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXJcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9ucyB3aWxsIGJlIGRlc3Ryb3llZCUwQSAgIyAoYmVjYXVzZSBhd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9ucyBpcyBub3QgaW4gY29uZmlndXJhdGlvbiklMEEgIC0gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNcIiB7JTBBICAgICAgLSBhcm4gICAgICAgICA9IFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlcjIwMjMwNzAzMDI1NzI4NjQ4NDAwMDAwMDAxXCIgLT4gbnVsbCUwQSAgICAgIC0gaWQgICAgICAgICAgPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXIyMDIzMDcwMzAyNTcyODY0ODQwMDAwMDAwMVwiIC0+IG51bGwlMEEgICAgICAtIG5hbWUgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDMwMjU3Mjg2NDg0MDAwMDAwMDFcIiAtPiBudWxsJTBBICAgICAgLSBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlclwiIC0+IG51bGwlMEEgICAgICAtIHBhdGggICAgICAgID0gXCIvXCIgLT4gbnVsbCUwQSAgICAgIC0gcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICAgIHslMEEgICAgICAgICAgICAgIC0gU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgIC0geyUwQSAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gXCJzMzpMaXN0QnVja2V0XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpQdXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpHZXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpEZWxldGVPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUvdGVycmFmb3JtLnRmc3RhdGVcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUvcGxhbnMvKlwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS8qLnppcFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6UHV0SXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOkdldEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJkeW5hbW9kYjpEZXNjcmliZVRhYmxlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOmR5bmFtb2RiOnVzLXdlc3QtMToyODkyNTYxMzg2MjQ6dGFibGUvaW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgLSBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICkgLT4gbnVsbCUwQSAgICAgIC0gcG9saWN5X2lkICAgPSBcIkFOUEFVR1dJQ002QUhTRFU2NDZTU1wiIC0+IG51bGwlMEEgICAgICAtIHRhZ3MgICAgICAgID0ge30gLT4gbnVsbCUwQSAgICAgIC0gdGFnc19hbGwgICAgPSB7JTBBICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgIH0gLT4gbnVsbCUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNfcm9cIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlci1yb1wiJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpHZXRPYmplY3RcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3BsYW5zLypcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUvKi56aXBcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNfcndcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlci1yd1wiJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0T2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6RGVsZXRlT2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3BsYW5zLypcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUvKi56aXBcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOlB1dEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpHZXRJdGVtXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkRlbGV0ZUl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpkeW5hbW9kYjp1cy13ZXN0LTE6Mjg5MjU2MTM4NjI0OnRhYmxlL2luZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyIHdpbGwgYmUgZGVzdHJveWVkJTBBICAjIChiZWNhdXNlIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKSUwQSAgLSByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlclwiIHslMEEgICAgICAtIGlkICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItMjAyMzA3MDMwMjU3Mjk1MjA0MDAwMDAwMDJcIiAtPiBudWxsJTBBICAgICAgLSBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDMwMjU3Mjg2NDg0MDAwMDAwMDFcIiAtPiBudWxsJTBBICAgICAgLSByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyXCIgLT4gbnVsbCUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXItcm9cIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXJcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXItcndcIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXJcIiUwQSAgICB9JTBBJTBBUGxhbjogMTYgdG8gYWRkLCAwIHRvIGNoYW5nZSwgOCB0byBkZXN0cm95LiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVJlbGVhc2luZyBzdGF0ZSBsb2NrLiBUaGlzIG1heSB0YWtlIGEgZmV3IG1vbWVudHMuLi4lMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMTYsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDh9fQ==```
</p></details>